OpenFOAM-master/of-xp/OpenFOAM-2.3.1/tutorials/mesh/foamyHexMesh/mixerVessel/Allrun-simulation
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

\cp system/controlDict.flow system/controlDict

# Set application name
application=$(getApplication)

# Get number of processors to run on
nProcs=$(getNumberOfProcessors)

\rm -rf 0

runApplication createBaffles -overwrite
runApplication mergeOrSplitBaffles -split -overwrite

# Get rid of zero faced patches
runApplication createPatch -overwrite

# Copy fields after meshing to avoind the generation of unnecessary patch fields
\cp -r 0.org 0

# Initialize alpha
runApplication setFields

# Decompose
\rm log.decomposePar
runApplication decomposePar -force

# Run
runParallel $application $nProcs

# Reconstruct
runApplication reconstructPar -noFunctionObjects


# ----------------------------------------------------------------- end-of-file
